app/controllers/api/benches_controller.rb

    def show
        @bench = Bench.find(params[:id])
---
SELECT  "benches".* FROM "benches" WHERE "benches"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        @benches = Bench.all
---
SELECT "benches".* FROM "benches"