app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Luigi"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        @user = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "JyYUM8_-POjdR0d_3j_OIw"], ["updated_at", "2021-12-28 16:49:56.165026"], ["id", 4]]
---
    def reset_session_token!
        self.session_token = generate_session_token
        self.save!